const numIslands = require('../../algorithm/200-Number-of-Islands/numIslands');

test('给你一个由1陆地和0水组成的的二维网格，请你计算网格中岛屿的数量', () => {
  const input = [
    [
      ['1', '1', '1', '1', '0'],
      ['1', '1', '0', '1', '0'],
      ['1', '1', '0', '0', '0'],
      ['0', '0', '0', '0', '0']
    ],
    [
      ['1', '1', '0', '0', '0'],
      ['1', '1', '0', '0', '0'],
      ['0', '0', '1', '0', '0'],
      ['0', '0', '0', '1', '1']
    ],
    [],
    [
      ['1', '1', '1', '1', '1'],
      ['1', '1', '1', '1', '1'],
      ['1', '1', '1', '1', '1'],
      ['1', '1', '1', '1', '1']
    ]
  ];
  const output = [1, 3, 0, 1];
  input.forEach((ele, i) => {
    expect(numIslands(ele)).toBe(output[i]);
  });
});
